Revit 2024 API
BuiltInFailures.RoomFailures.RoomHeightNegative Property
 [Room] must have a height greater than 0.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId RoomHeightNegative { get; }
Visual Basic
Public Shared ReadOnly Property RoomHeightNegative As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ RoomHeightNegative {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RoomFailures Class
Autodesk.Revit.DB Namespace